import React from 'react';
import { Col, Row } from 'react-grid-system';
import styled from 'styled-components';
import Flex from '../flex';
import { Colors } from '../../constants/colors';

const Styled = styled.div`
    padding:50px 0 0 0;
    .faq__content{
        gap:50px 0;
        @media screen and (max-width:480px){
            gap:30px 0;
        }
        .faq__item{
            padding:20px 50px 0 0;
            &--title{
                font-size: 20px;
                font-weight: 600;
                color:${Colors?.text_primary};
            }
            &--body{
                color:${Colors?.text_grey_2};
                font-weight:500;
                padding-top:20px;
                a{
                    color:${Colors?.main};
                    text-decoration:underline;
                }
            }
            @media screen and (max-width:576px){
                padding:20px 0 0 0;
                &--title{
                    font-size:18px;
                }
                &--body{
                    font-size:14px;
                }
            }
        }
    }
`

export default function FAQ() {
    return (
        <Styled>
            <Row className='faq__content'>
                <Col lg={6}>
                    <div className="faq__item">
                        <Flex gap='10px' >
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M10.7918 0.735436C11.2988 -0.245145 12.7012 -0.245145 13.2082 0.735436L16.4368 6.97973C16.5661 7.22995 16.77 7.43383 17.0203 7.56322L23.2645 10.7918C24.2452 11.2988 24.2452 12.7012 23.2645 13.2082L17.0203 16.4368C16.77 16.5661 16.5661 16.77 16.4368 17.0203L13.2082 23.2645C12.7012 24.2452 11.2988 24.2452 10.7918 23.2645L7.56322 17.0203C7.43383 16.77 7.22995 16.5661 6.97973 16.4368L0.735436 13.2082C-0.245145 12.7012 -0.245145 11.2988 0.735436 10.7918L6.97973 7.56322C7.22995 7.43383 7.43383 7.22995 7.56322 6.97973L10.7918 0.735436Z" fill="#5900E6" />
                            </svg>
                            <p className='faq__item--title'>Что такое «принт» ?</p>
                        </Flex>
                        <p className='faq__item--body'>«Принт» — это рисунок, узор или надпись, напечатанные на изделиях из ткани или керамики</p>
                    </div>
                </Col>
                <Col lg={6}>
                    <div className="faq__item">
                        <Flex gap='10px' >
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M19.8263 23.0335C19.8743 23.5657 18.5438 24.2442 18.1253 23.9119C14.521 21.0515 9.48211 21.0508 5.87701 23.9096C5.45826 24.2417 4.12628 23.5621 4.1741 23.0299C4.39399 20.5826 3.4173 19.606 0.970019 19.8258C0.437711 19.8737 -0.241804 18.5416 0.0902892 18.1229C2.94913 14.518 2.94834 9.47972 0.0879408 5.87568C-0.244274 5.4571 0.434149 4.12652 0.96639 4.17445C3.41634 4.39507 4.39411 3.41849 4.1741 0.970025C4.12627 0.437723 5.45826 -0.241799 5.87701 0.0902813C9.48211 2.94918 14.521 2.9484 18.1253 0.087934C18.5438 -0.244266 19.8743 0.434159 19.8263 0.966393C19.6055 3.41746 20.583 4.39513 23.0335 4.17446C23.5657 4.12654 24.2442 5.457 23.912 5.87561C21.0523 9.47968 21.0515 14.5181 23.9098 18.1229C24.2418 18.5417 23.5622 19.8737 23.0299 19.8258C20.582 19.606 19.6056 20.5837 19.8263 23.0335Z" fill="#5900E6" />
                            </svg>
                            <p className='faq__item--title'>Что такое 3D печать?</p>
                        </Flex>
                        <p className='faq__item--body'>Нанесение рисунка на ткань с использованием термопресса, что позволяет получить яркое объемное изображение, стойкое к различным воздействиям (стирка, глажка, повседневная носка).</p>
                    </div>
                </Col>
                <Col lg={6}>
                    <div className="faq__item">
                        <Flex gap='10px' >
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clipPath="url(#clip0_0_914)">
                                    <path d="M12 20.8486C2.92373 28.4333 -4.43326 21.0763 3.15145 12C-4.43326 2.92373 2.92373 -4.43326 12 3.15145C21.0745 -4.43326 28.4333 2.92373 20.8486 12C28.4333 21.0694 21.0745 28.4333 12 20.8486Z" fill="#5900E6" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_0_914">
                                        <rect width="24" height="24" fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                            <p className='faq__item--title'>Как выбрать размер?</p>
                        </Flex>
                        <p className='faq__item--body'>Для этого достаточно измерить обхват груди и разделить полученное число на 2. Если значение при этом получилось нечетным, то его следует увеличить на единицу. Затем свериться с таблицей размеров. Можете <a href="inweb.uz">взглянуть на пример!</a></p>
                    </div>
                </Col>
                <Col lg={6}>
                    <div className="faq__item">
                        <Flex gap='10px' >
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clipPath="url(#clip0_0_920)">
                                    <path d="M19.9155 16.0845C19.2594 16.7405 18.1956 16.7405 17.5396 16.0845L14.6432 13.1879C13.987 12.5319 13.987 11.4682 14.6432 10.8121L17.5396 7.91562C18.1956 7.25953 19.2594 7.25953 19.9155 7.91562L22.812 10.8121C23.4681 11.4682 23.4681 12.5319 22.812 13.1879L19.9155 16.0845ZM6.46023 16.0845C5.80415 16.7405 4.74042 16.7405 4.08435 16.0845L1.18786 13.1879C0.531781 12.5319 0.53178 11.4682 1.18786 10.8121L4.08435 7.91562C4.74042 7.25953 5.80415 7.25953 6.46023 7.91562L9.35672 10.8121C10.0128 11.4682 10.0128 12.5319 9.35672 13.1879L6.46023 16.0845ZM13.1879 22.812C12.5318 23.4682 11.4681 23.4682 10.812 22.812L7.91549 19.9156C7.25942 19.2596 7.25942 18.1958 7.91549 17.5397L10.812 14.6433C11.4681 13.9871 12.5318 13.9871 13.1879 14.6433L16.0844 17.5397C16.7404 18.1958 16.7404 19.2596 16.0844 19.9156L13.1879 22.812ZM13.1879 9.35683C12.5318 10.0129 11.4681 10.0129 10.812 9.35683L7.91549 6.46034C7.25942 5.80427 7.25942 4.74055 7.91549 4.08446L10.812 1.18798C11.4681 0.531903 12.5318 0.531902 13.1879 1.18798L16.0844 4.08446C16.7404 4.74055 16.7404 5.80427 16.0844 6.46034L13.1879 9.35683Z" fill="#5900E6" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_0_920">
                                        <rect width="24" height="24" fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                            <p className='faq__item--title'>Как стирать футболку с принтом?</p>
                        </Flex>
                        <p className='faq__item--body'>Стирать либо вручную, либо на деликатном режиме (макс. 600 оборотов при отжиме), вывернув футболку наизнанку.</p>
                    </div>
                </Col>
            </Row>
        </Styled>
    )
}
